import random


def answers():
    # age 13-15 ปี
    return [
        # "อยากได้คอมพิวเตอร์ใหม่",
        # "อยากให้คุณพ่อคุณแม่พาไปเที่ยว",
        # "อยากได้โทรศัพท์ หรือ ipad ใหม่ เพื่อใช่ในการเรียน",
        # "จะตั้งใจเรียน",
        # "จะเป็นเด็กดี",
        # "จะประหยัด ไม่ใช้จ่ายฟุ่มเฟือย",
        "จะตั้งใจเรียนให้จบ จะได้ดูแลพ่อแม่ได้",
        "เรียนจบแล้วจะทำอาชีพสุจริต เป็นคนดีของครอบครัวและสังคม",
        "อยากให้พ่อกับแม่ไว้ใจ ปล่อยให้เป็นอิสระบ้าง ให้ได้ทำในสิ่งที่ตัวเองชอบ",
        "จะทำทุกอย่างให้พ่อกับแม่มีความสุข",
        "อยากจะขอโทษในสิ่งที่ไม่ดีที่เคยได้ทำไว้กับพ่อแม่",
    ]


def response(responses, answers):
    return random.choices(answers, [4, 3, 5, 5, 6], k=responses)
